acing-interviews.org
#+BEGIN_EXPORT html
---
layout: default
title: Acing Interviews for Software Engineering Positions
date: 2022-08-16
categories: software-engineering
---
#+END_EXPORT

#+title:     Acing Interviews for Software Engineering Positions
#+author:    Logan Barnett
#+email:     logustus@gmail.com
#+date:      <2022-08-16 Tue>
#+language:  en
#+file_tags:
#+tags:
#+auto_id:   t

* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:

I've seen a lot of clamor over trying to "ace" interviews for software
engineering positions. While interviews can definitely go well and poorly, there
generally isn't a prescribed "right way" to do something. In this article, we'll
cover how interviews are put together, and what they target. We'll identify
objectively "bad" interviews, and we'll describe how good interviews work.

* Who Puts Together Interviews
:PROPERTIES:
:CUSTOM_ID: who-puts-together-interviews
:END:

Interviews are generally put together by a team lead. Higher-ups want to give
teams the agency for teams to do the filtering they want, so they stay out of
that process. I've seen some interview processes where higher-ups get involved
in a "meet and greet" fashion, so in a sense they retain some kind of veto
power. "Boss is an institution of mistrust". It makes them feel better. Let them
have it.

Team leads almost universally share some qualities which impacts how interviews
are structured and conducted:

** Team Leads are Perpetually Behind
:PROPERTIES:
:CUSTOM_ID: who-puts-together-interviews--team-leads-are-perpetually-behind
:END:

If a team lead isn't fighting to keep down tech debt in their own project, then
they are inherently allowing that tech debt to run its course through the
software. Fighting for tech debt usually means either they are spending a lot of
time helping with tech debt or they are buried in deliverables because they
spent a lot of time on that tech debt. In either case, the team lead runs around
like a ferret on amphetamines, trying to quickly resolve what they can before
moving onto the next thing.

How this comes out in interviews is that team leads will borrow other interview
material, or be quick to reuse or adapt some other material. They don't need
something perfect, they just need something close enough.

** Team Leads Want Thinkers
:PROPERTIES:
:CUSTOM_ID: who-puts-together-interviews--team-leads-want-thinkers
:END:

This is fairly universal: Team leads want good thinkers on their teams. I have
seen managers that want warm bodies - butts in seats which is about as close to
the archaic measurement of "lines of code" delivered per day. You aren't a warm
body, so you'll naturally repel anyone who is looking for them.

It's a human bias that team leads want someone like themselves: Folks who can
think through a problem and be able to solve it with some amount of autonomy,
and arrive at that solution in a way they find tolerable if not agreeable.

The leads who want thinkers will try to tailor their interviews in ways that
make you think.  We'll go into what that looks like in a bit.

** Team Leads are Tired of Cleaning up Messes
:PROPERTIES:
:CUSTOM_ID: who-puts-together-interviews--team-leads-are-tired-of-cleaning-up-messes
:END:

Every team lead is running around frantically trying to put out fires, meet
deadlines, and keep the software from imploding on itself like a neutron star
that's growing just a little too heavy.

Cleaning up messes that didn't need to be there in the first place is one of the
constant slights a team lead must endure, and they will use whatever agency they
have to minimize that. In an interview context that means filtering out people
who leave messes to clean up later, innocently believing that they are doing the
right thing.

I find everyone wants "quality code" (or more accurately but not stated as such:
quality work). As an industry we struggle to agree on these things sometimes.
That's okay. The interviewer wants to make sure you're a good fit for them just
as you're (hopefully) trying to make sure they're a good fit for you.


* The Goals of Interview Challenges
:PROPERTIES:
:CUSTOM_ID: the-goals-of-interview-challenges
:END:

By "challenges", I mean programming exercises, questions, etc. They might not
all be asking for emissions of code per se, but these are any sort of prompts
which are looking to tease out technical aptitude.

