acing-interviews.html
---
layout: default
title: Acing Interviews for Software Engineering Positions
date: 2022-08-16
categories: software-engineering
---
<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
I&rsquo;ve seen a lot of clamor over trying to &ldquo;ace&rdquo; interviews for software
engineering positions. While interviews can definitely go well and poorly, there
generally isn&rsquo;t a prescribed &ldquo;right way&rdquo; to do something. In this article, we&rsquo;ll
cover how interviews are put together, and what they target. We&rsquo;ll identify
objectively &ldquo;bad&rdquo; interviews, and we&rsquo;ll describe how good interviews work.
</p>
</div>
</div>
<div id="outline-container-who-puts-together-interviews" class="outline-2">
<h2 id="who-puts-together-interviews"><span class="section-number-2">2.</span> Who Puts Together Interviews</h2>
<div class="outline-text-2" id="text-who-puts-together-interviews">
<p>
Interviews are generally put together by a team lead. Higher-ups want to give
teams the agency for teams to do the filtering they want, so they stay out of
that process. I&rsquo;ve seen some interview processes where higher-ups get involved
in a &ldquo;meet and greet&rdquo; fashion, so in a sense they retain some kind of veto
power. &ldquo;Boss is an institution of mistrust&rdquo;. It makes them feel better. Let them
have it.
</p>

<p>
Team leads almost universally share some qualities which impacts how interviews
are structured and conducted:
</p>
</div>
<div id="outline-container-who-puts-together-interviews--team-leads-are-perpetually-behind" class="outline-3">
<h3 id="who-puts-together-interviews--team-leads-are-perpetually-behind"><span class="section-number-3">2.1.</span> Team Leads are Perpetually Behind</h3>
<div class="outline-text-3" id="text-who-puts-together-interviews--team-leads-are-perpetually-behind">
<p>
If a team lead isn&rsquo;t fighting to keep down tech debt in their own project, then
they are inherently allowing that tech debt to run its course through the
software. Fighting for tech debt usually means either they are spending a lot of
time helping with tech debt or they are buried in deliverables because they
spent a lot of time on that tech debt. In either case, the team lead runs around
like a ferret on amphetamines, trying to quickly resolve what they can before
moving onto the next thing.
</p>

<p>
How this comes out in interviews is that team leads will borrow other interview
material, or be quick to reuse or adapt some other material. They don&rsquo;t need
something perfect, they just need something close enough.
</p>
</div>
</div>
<div id="outline-container-who-puts-together-interviews--team-leads-want-thinkers" class="outline-3">
<h3 id="who-puts-together-interviews--team-leads-want-thinkers"><span class="section-number-3">2.2.</span> Team Leads Want Thinkers</h3>
<div class="outline-text-3" id="text-who-puts-together-interviews--team-leads-want-thinkers">
<p>
This is fairly universal: Team leads want good thinkers on their teams. I have
seen managers that want warm bodies - butts in seats which is about as close to
the archaic measurement of &ldquo;lines of code&rdquo; delivered per day. You aren&rsquo;t a warm
body, so you&rsquo;ll naturally repel anyone who is looking for them.
</p>

<p>
It&rsquo;s a human bias that team leads want someone like themselves: Folks who can
think through a problem and be able to solve it with some amount of autonomy,
and arrive at that solution in a way they find tolerable if not agreeable.
</p>

<p>
The leads who want thinkers will try to tailor their interviews in ways that
make you think.  We&rsquo;ll go into what that looks like in a bit.
</p>
</div>
</div>
<div id="outline-container-who-puts-together-interviews--team-leads-are-tired-of-cleaning-up-messes" class="outline-3">
<h3 id="who-puts-together-interviews--team-leads-are-tired-of-cleaning-up-messes"><span class="section-number-3">2.3.</span> Team Leads are Tired of Cleaning up Messes</h3>
<div class="outline-text-3" id="text-who-puts-together-interviews--team-leads-are-tired-of-cleaning-up-messes">
<p>
Every team lead is running around frantically trying to put out fires, meet
deadlines, and keep the software from imploding on itself like a neutron star
that&rsquo;s growing just a little too heavy.
</p>

<p>
Cleaning up messes that didn&rsquo;t need to be there in the first place is one of the
constant slights a team lead must endure, and they will use whatever agency they
have to minimize that. In an interview context that means filtering out people
who leave messes to clean up later, innocently believing that they are doing the
right thing.
</p>

<p>
I find everyone wants &ldquo;quality code&rdquo; (or more accurately but not stated as such:
quality work). As an industry we struggle to agree on these things sometimes.
That&rsquo;s okay. The interviewer wants to make sure you&rsquo;re a good fit for them just
as you&rsquo;re (hopefully) trying to make sure they&rsquo;re a good fit for you.
</p>
</div>
</div>
</div>
<div id="outline-container-the-goals-of-interview-challenges" class="outline-2">
<h2 id="the-goals-of-interview-challenges"><span class="section-number-2">3.</span> The Goals of Interview Challenges</h2>
<div class="outline-text-2" id="text-the-goals-of-interview-challenges">
<p>
By &ldquo;challenges&rdquo;, I mean programming exercises, questions, etc. They might not
all be asking for emissions of code per se, but these are any sort of prompts
which are looking to tease out technical aptitude.
</p>
</div>
