acing-interviews.org
** Does the Résumé Match
:PROPERTIES:
:CUSTOM_ID: the-goals-of-interview-challenges--does-the-résumé-match
:END:

A lot of résumés will have "proficiency with <tool>" and similar statements.
Similarly, there might be experience implied from various accomplishments on the
résumé. Interviewers generally have an idea that we're all required to put these
buzzword lists on our résumés so we can survive past the initial screens
conducted by the uninitiated. The lead said "I need people with some JavaScript
experience", and résumés stating "I did some JS a while ago, and while I'm
confident I can get back into it quickly, I honestly haven't had a lot of recent
practice with it" get culled by screeners. Sadly, it's also because some folks
really have inflated ideas of what "proficient" really means for a tool, and it
will differ greatly from what the interviewer considers proficient.

So an interview may be designed to tease out proficiency in things you already
said or demonstrated you are proficient in. Sometimes this means some simple
tasks. Things where it might seem like there's a trick question laying in the
thick somewhere. And, to be fair, there might be. But regardless, this is going
to be a part of the challenges. Do you know some of the jargon, pitfalls,
hardships, or subtleties of the topic? They'll be gunning for that. I wouldn't
worry about this too much. It doesn't hurt to remind the interviewer that you're
30 seconds of Googling to figuring out some of those silly API related questions
that are right out of technical documentation.  I've literally said in an
interview "I don't know how to do that readily, but I know it can be done and I
could look up it up a minute.  That said, I would want to see some good
justification of why we'd be doing <hacky thing>."  The interview wrapped up
right then and there and I got a job offer as a Angular.JS guru.

I've definitely encountered individuals who have made some steep claims of being
"familiar" with various technologies, but clearly don't know how to use them.
A recent example was being "very familiar" with Docker, but not knowing how
simple shell scripts work - which is an underlying necessity of all but the most
trivial usage of Docker. It's okay to not know things, but when you encounter
someone like this in the workplace, you end up doing a lot of their job for
them. It's best to know up front if you're signing up for this kind of work, or
signing your team up for it.  I want to stress this again though: It's really
okay to not know things.

As an interviewer I ideally want to find the boundaries of your knowledge on the
topic.  Do you have passing familiarity?  Have you used this tool in anger yet?
What sort of pitfalls have you encountered and how did you overcome them?  What
would you do differently if you had to do it again?  But also there will be
targeted questions.  For a coding challenge I had to conduct using coinage, I
frequently asked why used floating point numbers for money.  I never really got
an answer.  Okay fair - as someone working in web that probably doesn't come up
much, but I'd hope senior level interviewees could tell me _something_ about it.
If you're making database skins at the senior level, you should have a decent
idea of how to handle money safely.  The one interviewee I had that _didn't_ use
floating point numbers got asked why he didn't use them - ha! There's no escape,
you see.

** How Does the Interviewee Solve Problems
:PROPERTIES:
:CUSTOM_ID: the-goals-of-interview-challenges--how-does-the-interviewee-solve-problems
:END:

One of my favorite examples of this kind of goal is an incredibly thoughtful yet
non-technical thought experiment:

#+begin_quote
You drop a bowling ball from the surface of the ocean. How long does it take to
reach the bottom?
#+end_quote

That's really all you get for info. Yes, you're expected to ask questions about
this to gain more information. Is this comprehensive? Hardly. But it gets you
thinking about what exactly governs a bowling ball sinking into a massive body
of water. There's absolutely a wrong answer to this, and it's "3 hours, did I
get it right?" - which I guess is an answer actually given once. The exercise is
designed to tease apart your approach to the problem. How did you break it down?
What did you give consideration to? What questions did you ask?

Most of the time, you'll get one of these challenges but it will be wrapped in
some kind of contrived problem. FizzBuzz is a common challenge, but there are
many like it. Interviewers will try to put together one you've never encountered
before and guard it closely. Out of respect, I'm not posting some of the good
ones I know on such a public place. The whole point is to _make you struggle_.
If you know the answer, then there's no thinking done: It's just recollection.
If you don't know the answer, then you have to go into the process of breaking
down the problem and providing a solution.

The "how" of this process is far more important than the fact that _you actually
got it done_.  Sure, completing the challenge is a data point, but it's one
among many. As an interviewer I have suggested we move forward with candidates
who have failed to complete the challenge in time, and suggested we passed on
candidates who completed the challenge successfully.  Without having direct
recollection of these events, I can tell you right now what happened: The
candidate I recommended got tied up on some silly thing that we always encounter
in the real workplace (it was actually the floating point thing I mentioned
earlier), and would've eventually figured it out if given another hour or two.
We spoke about how the program would continue to develop and they gave great
answers.  Plus the process they'd already invested showed good thinking and
breaking down of the problem.  The candidate I passed on pretty much sat there
silently and just typed stuff until it worked.  They "aced" the interview.  But
I learned nothing of them in the process, and so I passed on them. I expect
other interviewers to conduct themselves similarly.

** Huge Bonus Points for Quality Work
:PROPERTIES:
:CUSTOM_ID: the-goals-of-interview-challenges--huge-bonus-points-for-quality-work
:END:

I've seen people write tests in their interview challenges - at least for the
ones where they had an editor and some time to work on the problem. I haven't
typically done these in mine because time is at too much of a premium.
Interviewers will ask at the end of the challenge what you'd have done
differently. This is your chance to talk about the things you'd imagine going
into a real application. So even if you didn't do quality work up front, or had
some part of the code where things got messy because you were moving fast in a
high pressure interview environment, you're still able to show where your values
are. If anything, I think it speaks to a candidate that they know when to do
quick-n-dirty but still know how to do it "well" when the pace is more relaxed.
If your interview challenge has a bunch of tests with no backing implementation
by the end of the time allotment, that would be a poor showing to me.  I know
other interviewers are totally fine with that though.  I don't think I'd pass on
a candidate strictly for that, to be fair.

