acing-interviews.html
<div id="outline-container-the-goals-of-interview-challenges--does-the-résumé-match" class="outline-3">
<h3 id="the-goals-of-interview-challenges--does-the-résumé-match"><span class="section-number-3">3.1.</span> Does the Résumé Match</h3>
<div class="outline-text-3" id="text-the-goals-of-interview-challenges--does-the-résumé-match">
<p>
A lot of résumés will have &ldquo;proficiency with &lt;tool&gt;&rdquo; and similar statements.
Similarly, there might be experience implied from various accomplishments on the
résumé. Interviewers generally have an idea that we&rsquo;re all required to put these
buzzword lists on our résumés so we can survive past the initial screens
conducted by the uninitiated. The lead said &ldquo;I need people with some JavaScript
experience&rdquo;, and résumés stating &ldquo;I did some JS a while ago, and while I&rsquo;m
confident I can get back into it quickly, I honestly haven&rsquo;t had a lot of recent
practice with it&rdquo; get culled by screeners. Sadly, it&rsquo;s also because some folks
really have inflated ideas of what &ldquo;proficient&rdquo; really means for a tool, and it
will differ greatly from what the interviewer considers proficient.
</p>

<p>
So an interview may be designed to tease out proficiency in things you already
said or demonstrated you are proficient in. Sometimes this means some simple
tasks. Things where it might seem like there&rsquo;s a trick question laying in the
thick somewhere. And, to be fair, there might be. But regardless, this is going
to be a part of the challenges. Do you know some of the jargon, pitfalls,
hardships, or subtleties of the topic? They&rsquo;ll be gunning for that. I wouldn&rsquo;t
worry about this too much. It doesn&rsquo;t hurt to remind the interviewer that you&rsquo;re
30 seconds of Googling to figuring out some of those silly API related questions
that are right out of technical documentation.  I&rsquo;ve literally said in an
interview &ldquo;I don&rsquo;t know how to do that readily, but I know it can be done and I
could look up it up a minute.  That said, I would want to see some good
justification of why we&rsquo;d be doing &lt;hacky thing&gt;.&rdquo;  The interview wrapped up
right then and there and I got a job offer as a Angular.JS guru.
</p>

<p>
I&rsquo;ve definitely encountered individuals who have made some steep claims of being
&ldquo;familiar&rdquo; with various technologies, but clearly don&rsquo;t know how to use them.
A recent example was being &ldquo;very familiar&rdquo; with Docker, but not knowing how
simple shell scripts work - which is an underlying necessity of all but the most
trivial usage of Docker. It&rsquo;s okay to not know things, but when you encounter
someone like this in the workplace, you end up doing a lot of their job for
them. It&rsquo;s best to know up front if you&rsquo;re signing up for this kind of work, or
signing your team up for it.  I want to stress this again though: It&rsquo;s really
okay to not know things.
</p>

<p>
As an interviewer I ideally want to find the boundaries of your knowledge on the
topic.  Do you have passing familiarity?  Have you used this tool in anger yet?
What sort of pitfalls have you encountered and how did you overcome them?  What
would you do differently if you had to do it again?  But also there will be
targeted questions.  For a coding challenge I had to conduct using coinage, I
frequently asked why used floating point numbers for money.  I never really got
an answer.  Okay fair - as someone working in web that probably doesn&rsquo;t come up
much, but I&rsquo;d hope senior level interviewees could tell me <span class="underline">something</span> about it.
If you&rsquo;re making database skins at the senior level, you should have a decent
idea of how to handle money safely.  The one interviewee I had that <span class="underline">didn&rsquo;t</span> use
floating point numbers got asked why he didn&rsquo;t use them - ha! There&rsquo;s no escape,
you see.
</p>
</div>
</div>
<div id="outline-container-the-goals-of-interview-challenges--how-does-the-interviewee-solve-problems" class="outline-3">
<h3 id="the-goals-of-interview-challenges--how-does-the-interviewee-solve-problems"><span class="section-number-3">3.2.</span> How Does the Interviewee Solve Problems</h3>
<div class="outline-text-3" id="text-the-goals-of-interview-challenges--how-does-the-interviewee-solve-problems">
<p>
One of my favorite examples of this kind of goal is an incredibly thoughtful yet
non-technical thought experiment:
</p>

<blockquote>
<p>
You drop a bowling ball from the surface of the ocean. How long does it take to
reach the bottom?
</p>
</blockquote>

<p>
That&rsquo;s really all you get for info. Yes, you&rsquo;re expected to ask questions about
this to gain more information. Is this comprehensive? Hardly. But it gets you
thinking about what exactly governs a bowling ball sinking into a massive body
of water. There&rsquo;s absolutely a wrong answer to this, and it&rsquo;s &ldquo;3 hours, did I
get it right?&rdquo; - which I guess is an answer actually given once. The exercise is
designed to tease apart your approach to the problem. How did you break it down?
What did you give consideration to? What questions did you ask?
</p>

<p>
Most of the time, you&rsquo;ll get one of these challenges but it will be wrapped in
some kind of contrived problem. FizzBuzz is a common challenge, but there are
many like it. Interviewers will try to put together one you&rsquo;ve never encountered
before and guard it closely. Out of respect, I&rsquo;m not posting some of the good
ones I know on such a public place. The whole point is to <span class="underline">make you struggle</span>.
If you know the answer, then there&rsquo;s no thinking done: It&rsquo;s just recollection.
If you don&rsquo;t know the answer, then you have to go into the process of breaking
down the problem and providing a solution.
</p>

<p>
The &ldquo;how&rdquo; of this process is far more important than the fact that <span class="underline">you actually
got it done</span>.  Sure, completing the challenge is a data point, but it&rsquo;s one
among many. As an interviewer I have suggested we move forward with candidates
who have failed to complete the challenge in time, and suggested we passed on
candidates who completed the challenge successfully.  Without having direct
recollection of these events, I can tell you right now what happened: The
candidate I recommended got tied up on some silly thing that we always encounter
in the real workplace (it was actually the floating point thing I mentioned
earlier), and would&rsquo;ve eventually figured it out if given another hour or two.
We spoke about how the program would continue to develop and they gave great
answers.  Plus the process they&rsquo;d already invested showed good thinking and
breaking down of the problem.  The candidate I passed on pretty much sat there
silently and just typed stuff until it worked.  They &ldquo;aced&rdquo; the interview.  But
I learned nothing of them in the process, and so I passed on them. I expect
other interviewers to conduct themselves similarly.
</p>
</div>
</div>
<div id="outline-container-the-goals-of-interview-challenges--huge-bonus-points-for-quality-work" class="outline-3">
<h3 id="the-goals-of-interview-challenges--huge-bonus-points-for-quality-work"><span class="section-number-3">3.3.</span> Huge Bonus Points for Quality Work</h3>
<div class="outline-text-3" id="text-the-goals-of-interview-challenges--huge-bonus-points-for-quality-work">
<p>
I&rsquo;ve seen people write tests in their interview challenges - at least for the
ones where they had an editor and some time to work on the problem. I haven&rsquo;t
typically done these in mine because time is at too much of a premium.
Interviewers will ask at the end of the challenge what you&rsquo;d have done
differently. This is your chance to talk about the things you&rsquo;d imagine going
into a real application. So even if you didn&rsquo;t do quality work up front, or had
some part of the code where things got messy because you were moving fast in a
high pressure interview environment, you&rsquo;re still able to show where your values
are. If anything, I think it speaks to a candidate that they know when to do
quick-n-dirty but still know how to do it &ldquo;well&rdquo; when the pace is more relaxed.
If your interview challenge has a bunch of tests with no backing implementation
by the end of the time allotment, that would be a poor showing to me.  I know
other interviewers are totally fine with that though.  I don&rsquo;t think I&rsquo;d pass on
a candidate strictly for that, to be fair.
</p>
</div>
</div>
</div>
