acing-interviews.org
* Interviewing is Messy and Highly Inaccurate
:PROPERTIES:
:CUSTOM_ID: interviewing-is-messy-and-highly-inaccurate
:END:

Interviewers know that the real value an employee delivers on the job can take
weeks to truly manifest in some palpable way. Even conducting an 8 hour
interview (as unethical as that is) is won't get answers that speak to your
qualities as a software engineer.

Because answers can be shared (some folks will put their submissions on github,
and others find it and plagiarize or use it to prep), this process is never
going to be non-subjective. There's been attempts at standardized interviewing
(I'll dig up some links at some point, but email me if you have some of your
own), but I haven't seen these stick yet.

I think if we could, we would love something equivalent to blind auditions in
the music industry. It's well documented how this process helps with diversity
and focuses getting the quality people you need. But we don't have that. Whoever
is able to one day solve that problem will become a big name in the industry
(think LinkedIn, Twitter, Google, Github, etc).

* Bad Interviews
:PROPERTIES:
:CUSTOM_ID: bad-interviews
:END:

Sometimes you'll wind up in bad interviews. Some folks get put into the position
of having to conduct interviews without having a good sense of what they need,
or they don't realize they are filtering for people who are good at
interviewing. Here's some objectively bad interview practices:

** Queries for Tool Knowledge
:PROPERTIES:
:CUSTOM_ID: bad-interviews--queries-for-tool-knowledge
:END:

Tools come and go. The tool you dearly covet today - what is it? React? Express?
Perhaps something else? There's a good chance that in 5 years, it'll have joined
the world of legacy-only usage. Software that still see use today, but whose
foundational tools few or none are spinning up new projects for. The industry
has moved on, and these projects are left behind for others to maintain. Lots of
stuff survives for 5 years, but 10? 15? The longer it goes, the more likely it
joins that retirement home of tools. There was saying "Nobody got fired for
picking Java". Do you think that still holds true for today?

Trying to grill a candidate on tool knowledge is a terrible practice for a few
reasons: Generally these questions can be answered from 30 seconds of Googling.
Tools might seem like a big struggle when you're new to the industry, but they
come and go so much. Any interviewer worth their salt is going to want someone
who is skilled and has the capability to learn. Bonus points if you already know
the tools.

There are exceptions: Interviewers will settle for candidates that know a tool
over having better general skills because they just need to get some work done
in a particular area. They might need a "guru" for a particular tool, which they
expect will distill knowledge about that tool to the rest of the team or help
them out in a tricky spot they are in. I assume you're reading this because
you're not really a guru in anything yet - a normal state to be in!

** Trying to Find a Clone
:PROPERTIES:
:CUSTOM_ID: bad-interviews--trying-to-find-a-clone
:END:
** Assuming Significant Interview Time
:PROPERTIES:
:CUSTOM_ID: bad-interviews--assuming-significant-interview-time
:END:
* How to Present Your Best
:PROPERTIES:
:CUSTOM_ID: how-to-present-your-best
:END:

Making you a better candidate is beyond the scope of this post.  It's also very
subjective.  That said, you can present yourself to the interviewer so they get
an idea as best they can.

** Talk Through What You're Doing During Challenges
:PROPERTIES:
:CUSTOM_ID: how-to-present-your-best--talk-through-what-you're-doing-during-challenges
:END:

This is #1 and for good reason.  Tell me what you're thinking as you do the
challenge.  It doesn't matter if it sounds stupid.  The interviewer designed
this specifically for you to stumble with it.  Stumbling is part of the process
to real problem solving.  Most ideas don't actually gestate very well and that's
where majority of the cost of problem solving goes.

Specifically what I want to hear you thinking about is the problem.  I can see
that you're writing a =for= loop or declaring a variable, so those aren't
particularly useful.  Though I'd prefer you talk about your =for= loops if it
means I get to hear the juicy stuff.  Sometimes talking about programming
constructs is important.  Why did you pick a =for= loop instead of using another
construct like =map= or =reduce=?  There could be some good tidbits in there.

Regarding talking about things: It would even be valid to say something like
"I'm using a =for= loop here because I'm familiar enough with older JavaScript
to do that.  I know there's =map= but I'm skipping it to get through this
exercise".  This tells me that you value =map=.  It tells me that you're taking
shortcuts because it's an interview and you'd like to complete it, but you know
there's better ways to do it.  It tells me you are aware your knowledge of
JavaScript is old and therefore you'll need to tread slowly for a while until
you acclimatize to the new stuff.  It even tells me as the interviewer that I
should be ready to nudge you or help you past some gotchas with modern
JavaScript.  I don't want to see you struggle with that - in fact we just
established that you're doing an old style because _you literally just said
that_.  I have the information I need regarding your current-ness.

If you find yourself seizing up during this process, go desensitize yourself to
it.  Have a friend or someone of technical skill sit there and listen to you as
you go through one of the many free code-challenge suites out there.  30 seconds
without saying anything is too long of silence.

I'm going to go out on a limb here and mention this - I believe, at least by
American culture, that women are largely discouraged from showing their
abilities in any sort of public settings.  I wasn't raised as a woman, so it's
hard for me to point a finger at exactly what the cause is there.  Though
women have agreed with me that it is a real thing.  If this is you, be aware of
this bias and work to shake it.  Unfortunately the industry isn't going to
accommodate you well here, and this is one of those places where you just have
to do what everyone else does but it's harder.  Desensitizing yourself to it is
the only thing I can think of.  Alternatively, I've seen a lot of women thriving
in positions where their work isn't public - or at least whatever it is they
directly emit.  Whatever works for you!  Personally, I think the best defense
against scrutiny for you will always be to just keep putting your stuff out
there until you've truly internalized that we're all fumbling around in the
dark.

