acing-interviews.html
<div id="outline-container-interviewing-is-messy-and-highly-inaccurate" class="outline-2">
<h2 id="interviewing-is-messy-and-highly-inaccurate"><span class="section-number-2">4.</span> Interviewing is Messy and Highly Inaccurate</h2>
<div class="outline-text-2" id="text-interviewing-is-messy-and-highly-inaccurate">
<p>
Interviewers know that the real value an employee delivers on the job can take
weeks to truly manifest in some palpable way. Even conducting an 8 hour
interview (as unethical as that is) is won&rsquo;t get answers that speak to your
qualities as a software engineer.
</p>

<p>
Because answers can be shared (some folks will put their submissions on github,
and others find it and plagiarize or use it to prep), this process is never
going to be non-subjective. There&rsquo;s been attempts at standardized interviewing
(I&rsquo;ll dig up some links at some point, but email me if you have some of your
own), but I haven&rsquo;t seen these stick yet.
</p>

<p>
I think if we could, we would love something equivalent to blind auditions in
the music industry. It&rsquo;s well documented how this process helps with diversity
and focuses getting the quality people you need. But we don&rsquo;t have that. Whoever
is able to one day solve that problem will become a big name in the industry
(think LinkedIn, Twitter, Google, Github, etc).
</p>
</div>
</div>
<div id="outline-container-bad-interviews" class="outline-2">
<h2 id="bad-interviews"><span class="section-number-2">5.</span> Bad Interviews</h2>
<div class="outline-text-2" id="text-bad-interviews">
<p>
Sometimes you&rsquo;ll wind up in bad interviews. Some folks get put into the position
of having to conduct interviews without having a good sense of what they need,
or they don&rsquo;t realize they are filtering for people who are good at
interviewing. Here&rsquo;s some objectively bad interview practices:
</p>
</div>
<div id="outline-container-bad-interviews--queries-for-tool-knowledge" class="outline-3">
<h3 id="bad-interviews--queries-for-tool-knowledge"><span class="section-number-3">5.1.</span> Queries for Tool Knowledge</h3>
<div class="outline-text-3" id="text-bad-interviews--queries-for-tool-knowledge">
<p>
Tools come and go. The tool you dearly covet today - what is it? React? Express?
Perhaps something else? There&rsquo;s a good chance that in 5 years, it&rsquo;ll have joined
the world of legacy-only usage. Software that still see use today, but whose
foundational tools few or none are spinning up new projects for. The industry
has moved on, and these projects are left behind for others to maintain. Lots of
stuff survives for 5 years, but 10? 15? The longer it goes, the more likely it
joins that retirement home of tools. There was saying &ldquo;Nobody got fired for
picking Java&rdquo;. Do you think that still holds true for today?
</p>

<p>
Trying to grill a candidate on tool knowledge is a terrible practice for a few
reasons: Generally these questions can be answered from 30 seconds of Googling.
Tools might seem like a big struggle when you&rsquo;re new to the industry, but they
come and go so much. Any interviewer worth their salt is going to want someone
who is skilled and has the capability to learn. Bonus points if you already know
the tools.
</p>

<p>
There are exceptions: Interviewers will settle for candidates that know a tool
over having better general skills because they just need to get some work done
in a particular area. They might need a &ldquo;guru&rdquo; for a particular tool, which they
expect will distill knowledge about that tool to the rest of the team or help
them out in a tricky spot they are in. I assume you&rsquo;re reading this because
you&rsquo;re not really a guru in anything yet - a normal state to be in!
</p>
</div>
</div>
<div id="outline-container-bad-interviews--trying-to-find-a-clone" class="outline-3">
<h3 id="bad-interviews--trying-to-find-a-clone"><span class="section-number-3">5.2.</span> Trying to Find a Clone</h3>
<div class="outline-text-3" id="text-bad-interviews--trying-to-find-a-clone">
</div>
</div>
<div id="outline-container-bad-interviews--assuming-significant-interview-time" class="outline-3">
<h3 id="bad-interviews--assuming-significant-interview-time"><span class="section-number-3">5.3.</span> Assuming Significant Interview Time</h3>
<div class="outline-text-3" id="text-bad-interviews--assuming-significant-interview-time">
</div>
</div>
</div>
<div id="outline-container-how-to-present-your-best" class="outline-2">
<h2 id="how-to-present-your-best"><span class="section-number-2">6.</span> How to Present Your Best</h2>
<div class="outline-text-2" id="text-how-to-present-your-best">
<p>
Making you a better candidate is beyond the scope of this post.  It&rsquo;s also very
subjective.  That said, you can present yourself to the interviewer so they get
an idea as best they can.
</p>
</div>
<div id="outline-container-how-to-present-your-best--talk-through-what-you're-doing-during-challenges" class="outline-3">
<h3 id="how-to-present-your-best--talk-through-what-you're-doing-during-challenges"><span class="section-number-3">6.1.</span> Talk Through What You&rsquo;re Doing During Challenges</h3>
<div class="outline-text-3" id="text-how-to-present-your-best--talk-through-what-you're-doing-during-challenges">
<p>
This is #1 and for good reason.  Tell me what you&rsquo;re thinking as you do the
challenge.  It doesn&rsquo;t matter if it sounds stupid.  The interviewer designed
this specifically for you to stumble with it.  Stumbling is part of the process
to real problem solving.  Most ideas don&rsquo;t actually gestate very well and that&rsquo;s
where majority of the cost of problem solving goes.
</p>

<p>
Specifically what I want to hear you thinking about is the problem.  I can see
that you&rsquo;re writing a <code>for</code> loop or declaring a variable, so those aren&rsquo;t
particularly useful.  Though I&rsquo;d prefer you talk about your <code>for</code> loops if it
means I get to hear the juicy stuff.  Sometimes talking about programming
constructs is important.  Why did you pick a <code>for</code> loop instead of using another
construct like <code>map</code> or <code>reduce</code>?  There could be some good tidbits in there.
</p>

<p>
Regarding talking about things: It would even be valid to say something like
&ldquo;I&rsquo;m using a <code>for</code> loop here because I&rsquo;m familiar enough with older JavaScript
to do that.  I know there&rsquo;s <code>map</code> but I&rsquo;m skipping it to get through this
exercise&rdquo;.  This tells me that you value <code>map</code>.  It tells me that you&rsquo;re taking
shortcuts because it&rsquo;s an interview and you&rsquo;d like to complete it, but you know
there&rsquo;s better ways to do it.  It tells me you are aware your knowledge of
JavaScript is old and therefore you&rsquo;ll need to tread slowly for a while until
you acclimatize to the new stuff.  It even tells me as the interviewer that I
should be ready to nudge you or help you past some gotchas with modern
JavaScript.  I don&rsquo;t want to see you struggle with that - in fact we just
established that you&rsquo;re doing an old style because <span class="underline">you literally just said
that</span>.  I have the information I need regarding your current-ness.
</p>

<p>
If you find yourself seizing up during this process, go desensitize yourself to
it.  Have a friend or someone of technical skill sit there and listen to you as
you go through one of the many free code-challenge suites out there.  30 seconds
without saying anything is too long of silence.
</p>

<p>
I&rsquo;m going to go out on a limb here and mention this - I believe, at least by
American culture, that women are largely discouraged from showing their
abilities in any sort of public settings.  I wasn&rsquo;t raised as a woman, so it&rsquo;s
hard for me to point a finger at exactly what the cause is there.  Though
women have agreed with me that it is a real thing.  If this is you, be aware of
this bias and work to shake it.  Unfortunately the industry isn&rsquo;t going to
accommodate you well here, and this is one of those places where you just have
to do what everyone else does but it&rsquo;s harder.  Desensitizing yourself to it is
the only thing I can think of.  Alternatively, I&rsquo;ve seen a lot of women thriving
in positions where their work isn&rsquo;t public - or at least whatever it is they
directly emit.  Whatever works for you!  Personally, I think the best defense
against scrutiny for you will always be to just keep putting your stuff out
there until you&rsquo;ve truly internalized that we&rsquo;re all fumbling around in the
dark.
</p>
</div>
</div>
