acing-interviews.org
** Be Painfully Blunt About What You Don't Know
:PROPERTIES:
:CUSTOM_ID: how-to-present-your-best--be-painfully-blunt-about-what-you-don't-know
:END:

This is kind of related to the dunning kruger effect - which is that experienced
or "wise" people tend to express themselves less confidently and the
inexperienced tend to express themselves very confidently.  You might not be
experienced yet and that's okay.  But regardless if you get asked something
about stuff you don't know, you should quickly say you don't know.  Practice it
with friends or something.

I have a friend who has risen to much higher places in the career chain with me,
and he says his interview style is "I try to convince them not to hire me",
which is kind of his odd way of saying he admits his weaknesses and lack of
knowledge readily.

You can try to take a guess.  "I don't know for sure but if I had to guess..."
but do keep in mind this is perilous.  I've had an interviewee do this once and
it revealed an extreme level of ignorance on the topic.  It's likely that
interviewee wasn't going to get the position anyways.  Just be really careful
about talking about things you literally don't know anything about.  Perhaps a
better approach would be to ask about it.  Interviewers love to talk about their
stuff so this isn't a big ask at all.

But above all else, "I don't know" is one of your best phrases you can use in an
interview.

** Ask the Interviewer What They Want to See
:PROPERTIES:
:CUSTOM_ID: how-to-present-your-best--ask-the-interviewer-what-they-want-to-see
:END:

Here's a few questions you can crib from this post:

#+begin_quote
Do you want to see tests or feel we have time for them?
#+end_quote

#+begin_quote
Would you like me to push this to a git repository?
#+end_quote

I've seen this one:

#+begin_quote
Can I assume valid input?
#+end_quote

Though to be honest I don't like it.  It tells me you have a gated-community
mindset when it comes to software engineering.  A lot of people are okay with
this though - just be in mind that it says something about you too.  I just
don't assume valid input.

** Interview Them Back
:PROPERTIES:
:CUSTOM_ID: how-to-present-your-best--interview-them-back
:END:

Interviews go both ways.  I try to keep the interview about 50% of me, and 50%
of them.

#+begin_quote
When is the last time you worked a late evening or into a weekend?
#+end_quote

I highly value sustainable pace, so this one comes up a lot.  One place I worked
at where the pace was not sustainable for me was one where I'd made the mistake
of not asking this question.

Directly engaging with the material, even asking questions as if you have
already landed the job can be a very powerful thing.  Questions such as these
can help put you in that place:

#+begin_quote
What sort of challenges does your team encounter with the
product/tools/tech/suite?
#+end_quote

#+begin_quote
What's a typical day in office look like for a typical team member?
#+end_quote

#+begin_quote
Do you have a particular section or set of tasks you would like me to be working
on?
#+end_quote

** Put Your Best Foot Forward
:PROPERTIES:
:CUSTOM_ID: how-to-present-your-best--put-your-best-foot-forward
:END:

I know people who dropped F-bombs in interviews and still go the position.
Getting really informal won't always count against you, but being formal will
never count against you.  Being informal has a tendency to also stray into the
unprofessional territory, or even bad enough to be a walking HR time bomb.  I
don't want coworkers that I need to shield from external or select team
members - that's _work for me_.  Additionally it communicates that if you can't
act like an adult for a couple of hours then you likely won't act like an adult
when things get difficult.

I have worn a suit and tie into an interview and was laughed at about it.  I've
done that at a few places, but most of the time I'll make sure I'm in some sort
of collared shirt and pants.  Even if I'm meeting virtually, I would wear that
collar.  I'd be more lax about this if they knew I was stepping away from lunch
at my current job to meet up (informally or for an interview).

Don't get me wrong - you don't have to be an emotionless robot.  I've asked my
interviewers if they were Horde or Alliance (a World of Warcraft reference) -
and was offered the position.  I forgot what gave me the knowledge that they
played, but it helped I think.

Do not stray into politics or religion (unless that religion is Emacs).  Do
_not_ joke about the initialism for Bitbucket Cloud.

* For Entry Level Engineers
:PROPERTIES:
:CUSTOM_ID: for-entry-level-engineers
:END:

You will come off as a steal if you can demonstrate the following:

1. Basic =git= usage. Commit, push, pull, clone, switch branches, merge (I
   wouldn't stress conflict resolution, but huge points if you can swing it).
   Even outside of the world of database skins, everyone is using =git= or a
   tool that serves a similar purpose.
2. Know the syntax well for one language - preferably the one you studied the
   most for.  This may not match up with the position.  It's worrisome if you
   know 25% of several various languages.  It makes me wonder whether or not you
   really learned how to do software engineering.  To be clear here: The syntax
   is the glyphs and structure of the code.  The keywords like =if=, =else=,
   =for=, =while=, etc.
3. Know how to manipulate basic data structures in your most studied language.
   You should be able to manipulate lists, queues, and stacks.  You don't have
   to be a guru with data structures and algorithms.
4. Make sure you can write a program that actually does something.  If you've
   not done this yet, you really need to.  It will be hard and take a lot of
   time, but it will really help you grow and make sure you "get it".
5. Be able to write a program that works on the command line.  I've seen a lot
   of new blood spending a lot of time in the area of the database skin (so
   React, Express, etc) and when asked to write a command line program they fled
   in terror.  There's a _really_ good chance that an interview won't use
   database skin technology at all, even if that's what you're applying for.  It
   also is so helpful for writing demos, demonstrating some knowledge of the
   command line itself (even if it's very basic), and much documentation and
   examples expect you to be familiar with putting together basic command line
   programs.  I do have a sort of primer on [[file:./command-line-programs.org][command line programs]] you're free to
   check out - though it covers way more than what I'm talking about here.  I'm
   talking about the simplest of programs here.

* "Aced" it, but Didn't Get the Job
:PROPERTIES:
:CUSTOM_ID: aced-it-but-didn't-get-the-job
:END:

You might do everything well in an interview and still not get the job. It might
have even gone swimmingly.

