acing-interviews.html
<div id="outline-container-how-to-present-your-best--be-painfully-blunt-about-what-you-don't-know" class="outline-3">
<h3 id="how-to-present-your-best--be-painfully-blunt-about-what-you-don't-know"><span class="section-number-3">6.2.</span> Be Painfully Blunt About What You Don&rsquo;t Know</h3>
<div class="outline-text-3" id="text-how-to-present-your-best--be-painfully-blunt-about-what-you-don't-know">
<p>
This is kind of related to the dunning kruger effect - which is that experienced
or &ldquo;wise&rdquo; people tend to express themselves less confidently and the
inexperienced tend to express themselves very confidently.  You might not be
experienced yet and that&rsquo;s okay.  But regardless if you get asked something
about stuff you don&rsquo;t know, you should quickly say you don&rsquo;t know.  Practice it
with friends or something.
</p>

<p>
I have a friend who has risen to much higher places in the career chain with me,
and he says his interview style is &ldquo;I try to convince them not to hire me&rdquo;,
which is kind of his odd way of saying he admits his weaknesses and lack of
knowledge readily.
</p>

<p>
You can try to take a guess.  &ldquo;I don&rsquo;t know for sure but if I had to guess&#x2026;&rdquo;
but do keep in mind this is perilous.  I&rsquo;ve had an interviewee do this once and
it revealed an extreme level of ignorance on the topic.  It&rsquo;s likely that
interviewee wasn&rsquo;t going to get the position anyways.  Just be really careful
about talking about things you literally don&rsquo;t know anything about.  Perhaps a
better approach would be to ask about it.  Interviewers love to talk about their
stuff so this isn&rsquo;t a big ask at all.
</p>

<p>
But above all else, &ldquo;I don&rsquo;t know&rdquo; is one of your best phrases you can use in an
interview.
</p>
</div>
</div>
<div id="outline-container-how-to-present-your-best--ask-the-interviewer-what-they-want-to-see" class="outline-3">
<h3 id="how-to-present-your-best--ask-the-interviewer-what-they-want-to-see"><span class="section-number-3">6.3.</span> Ask the Interviewer What They Want to See</h3>
<div class="outline-text-3" id="text-how-to-present-your-best--ask-the-interviewer-what-they-want-to-see">
<p>
Here&rsquo;s a few questions you can crib from this post:
</p>

<blockquote>
<p>
Do you want to see tests or feel we have time for them?
</p>
</blockquote>

<blockquote>
<p>
Would you like me to push this to a git repository?
</p>
</blockquote>

<p>
I&rsquo;ve seen this one:
</p>

<blockquote>
<p>
Can I assume valid input?
</p>
</blockquote>

<p>
Though to be honest I don&rsquo;t like it.  It tells me you have a gated-community
mindset when it comes to software engineering.  A lot of people are okay with
this though - just be in mind that it says something about you too.  I just
don&rsquo;t assume valid input.
</p>
</div>
</div>
<div id="outline-container-how-to-present-your-best--interview-them-back" class="outline-3">
<h3 id="how-to-present-your-best--interview-them-back"><span class="section-number-3">6.4.</span> Interview Them Back</h3>
<div class="outline-text-3" id="text-how-to-present-your-best--interview-them-back">
<p>
Interviews go both ways.  I try to keep the interview about 50% of me, and 50%
of them.
</p>

<blockquote>
<p>
When is the last time you worked a late evening or into a weekend?
</p>
</blockquote>

<p>
I highly value sustainable pace, so this one comes up a lot.  One place I worked
at where the pace was not sustainable for me was one where I&rsquo;d made the mistake
of not asking this question.
</p>

<p>
Directly engaging with the material, even asking questions as if you have
already landed the job can be a very powerful thing.  Questions such as these
can help put you in that place:
</p>

<blockquote>
<p>
What sort of challenges does your team encounter with the
product/tools/tech/suite?
</p>
</blockquote>

<blockquote>
<p>
What&rsquo;s a typical day in office look like for a typical team member?
</p>
</blockquote>

<blockquote>
<p>
Do you have a particular section or set of tasks you would like me to be working
on?
</p>
</blockquote>
</div>
</div>
<div id="outline-container-how-to-present-your-best--put-your-best-foot-forward" class="outline-3">
<h3 id="how-to-present-your-best--put-your-best-foot-forward"><span class="section-number-3">6.5.</span> Put Your Best Foot Forward</h3>
<div class="outline-text-3" id="text-how-to-present-your-best--put-your-best-foot-forward">
<p>
I know people who dropped F-bombs in interviews and still go the position.
Getting really informal won&rsquo;t always count against you, but being formal will
never count against you.  Being informal has a tendency to also stray into the
unprofessional territory, or even bad enough to be a walking HR time bomb.  I
don&rsquo;t want coworkers that I need to shield from external or select team
members - that&rsquo;s <span class="underline">work for me</span>.  Additionally it communicates that if you can&rsquo;t
act like an adult for a couple of hours then you likely won&rsquo;t act like an adult
when things get difficult.
</p>

<p>
I have worn a suit and tie into an interview and was laughed at about it.  I&rsquo;ve
done that at a few places, but most of the time I&rsquo;ll make sure I&rsquo;m in some sort
of collared shirt and pants.  Even if I&rsquo;m meeting virtually, I would wear that
collar.  I&rsquo;d be more lax about this if they knew I was stepping away from lunch
at my current job to meet up (informally or for an interview).
</p>

<p>
Don&rsquo;t get me wrong - you don&rsquo;t have to be an emotionless robot.  I&rsquo;ve asked my
interviewers if they were Horde or Alliance (a World of Warcraft reference) -
and was offered the position.  I forgot what gave me the knowledge that they
played, but it helped I think.
</p>

<p>
Do not stray into politics or religion (unless that religion is Emacs).  Do
<span class="underline">not</span> joke about the initialism for Bitbucket Cloud.
</p>
</div>
</div>
</div>
<div id="outline-container-for-entry-level-engineers" class="outline-2">
<h2 id="for-entry-level-engineers"><span class="section-number-2">7.</span> For Entry Level Engineers</h2>
<div class="outline-text-2" id="text-for-entry-level-engineers">
<p>
You will come off as a steal if you can demonstrate the following:
</p>

<ol class="org-ol">
<li>Basic <code>git</code> usage. Commit, push, pull, clone, switch branches, merge (I
wouldn&rsquo;t stress conflict resolution, but huge points if you can swing it).
Even outside of the world of database skins, everyone is using <code>git</code> or a
tool that serves a similar purpose.</li>
<li>Know the syntax well for one language - preferably the one you studied the
most for.  This may not match up with the position.  It&rsquo;s worrisome if you
know 25% of several various languages.  It makes me wonder whether or not you
really learned how to do software engineering.  To be clear here: The syntax
is the glyphs and structure of the code.  The keywords like <code>if</code>, <code>else</code>,
<code>for</code>, <code>while</code>, etc.</li>
<li>Know how to manipulate basic data structures in your most studied language.
You should be able to manipulate lists, queues, and stacks.  You don&rsquo;t have
to be a guru with data structures and algorithms.</li>
<li>Make sure you can write a program that actually does something.  If you&rsquo;ve
not done this yet, you really need to.  It will be hard and take a lot of
time, but it will really help you grow and make sure you &ldquo;get it&rdquo;.</li>
<li>Be able to write a program that works on the command line.  I&rsquo;ve seen a lot
of new blood spending a lot of time in the area of the database skin (so
React, Express, etc) and when asked to write a command line program they fled
in terror.  There&rsquo;s a <span class="underline">really</span> good chance that an interview won&rsquo;t use
database skin technology at all, even if that&rsquo;s what you&rsquo;re applying for.  It
also is so helpful for writing demos, demonstrating some knowledge of the
command line itself (even if it&rsquo;s very basic), and much documentation and
examples expect you to be familiar with putting together basic command line
programs.  I do have a sort of primer on <a href="./command-line-programs.html">command line programs</a> you&rsquo;re free to
check out - though it covers way more than what I&rsquo;m talking about here.  I&rsquo;m
talking about the simplest of programs here.</li>
</ol>
</div>
</div>
<div id="outline-container-aced-it-but-didn't-get-the-job" class="outline-2">
<h2 id="aced-it-but-didn't-get-the-job"><span class="section-number-2">8.</span> &ldquo;Aced&rdquo; it, but Didn&rsquo;t Get the Job</h2>
<div class="outline-text-2" id="text-aced-it-but-didn't-get-the-job">
<p>
You might do everything well in an interview and still not get the job. It might
have even gone swimmingly.
</p>
</div>
