acing-interviews.org
** The Interviewer Might Have Been Vetoed
:PROPERTIES:
:CUSTOM_ID: aced-it-but-didn't-get-the-job--the-interviewer-might-have-been-vetoed
:END:

As an interviewer, I've had candidates I really wanted us to snag because I
thought they were great. Management didn't take my recommendation (which is
their prerogative) and passed on the candidate.

A team member can sometimes also produce a veto. One of the reasons candidates
meet the entire team is so people get a "vibe".  While this interview process
runs very counter to having a richly diverse set of employees, many places
practice it to this day. Indeed, it's a common management practice to take many
steps to make employees feel "heard". One way to do that is give them input on
who is hired. On its base value, it makes a kind of sense: Nobody wants to work
with an asshole, and if you met a candidate that was later hired and you didn't
speak up then, then you're just as surprised as everyone else about any
asshole-ness that is experienced later.

** There Might Have Been a Better Candidate
:PROPERTIES:
:CUSTOM_ID: aced-it-but-didn't-get-the-job--there-might-have-been-a-better-candidate
:END:

You might've been a 96% match during your interview and the other person was
97%. It might've been decided by something totally out of your control, and in
fact if you felt like the interview went well, it probably was out of your
control. You could spend a bunch of time second guessing everything like hiccup
you had, but that's both counterproductive and probably wrong.

How hiring typically works is an organization will have approved the budget for
a particular level of engineer to come on board. They've already picked the
salary range and the number of positions they are willing to hire. So in that
sense for that position it really is a zero sum game. I suppose it's possible
for "opportunity hires" to take place, but nobody can cut blank checks so I
expect this to be virtually non-existent.

The best thing to do here is just move on, and maybe consider re-applying to
this place later, or even applying to another position at the same workplace.
Many places encourage this, though I haven't seen them do much to facilitate it.

My message to interviewers that encourage re-applying to different positions: If
you want people to re-apply because you want their talent, be sure to follow up
with them instead of making them do it! Don't forget that candidates oftentimes
have other places they've already applied to and it's usually just as much
energy to apply again to your workplace as it is to apply to another. You've
already turned them down once, so if anything you now require more energy to
apply to than any other random job. I've straight up given up on places because
it placed this kind of onus on me. I wanted a new job in software engineering,
not a job in applying jobs ;)
