acing-interviews.html
<div id="outline-container-aced-it-but-didn't-get-the-job--the-interviewer-might-have-been-vetoed" class="outline-3">
<h3 id="aced-it-but-didn't-get-the-job--the-interviewer-might-have-been-vetoed"><span class="section-number-3">8.1.</span> The Interviewer Might Have Been Vetoed</h3>
<div class="outline-text-3" id="text-aced-it-but-didn't-get-the-job--the-interviewer-might-have-been-vetoed">
<p>
As an interviewer, I&rsquo;ve had candidates I really wanted us to snag because I
thought they were great. Management didn&rsquo;t take my recommendation (which is
their prerogative) and passed on the candidate.
</p>

<p>
A team member can sometimes also produce a veto. One of the reasons candidates
meet the entire team is so people get a &ldquo;vibe&rdquo;.  While this interview process
runs very counter to having a richly diverse set of employees, many places
practice it to this day. Indeed, it&rsquo;s a common management practice to take many
steps to make employees feel &ldquo;heard&rdquo;. One way to do that is give them input on
who is hired. On its base value, it makes a kind of sense: Nobody wants to work
with an asshole, and if you met a candidate that was later hired and you didn&rsquo;t
speak up then, then you&rsquo;re just as surprised as everyone else about any
asshole-ness that is experienced later.
</p>
</div>
</div>
<div id="outline-container-aced-it-but-didn't-get-the-job--there-might-have-been-a-better-candidate" class="outline-3">
<h3 id="aced-it-but-didn't-get-the-job--there-might-have-been-a-better-candidate"><span class="section-number-3">8.2.</span> There Might Have Been a Better Candidate</h3>
<div class="outline-text-3" id="text-aced-it-but-didn't-get-the-job--there-might-have-been-a-better-candidate">
<p>
You might&rsquo;ve been a 96% match during your interview and the other person was
97%. It might&rsquo;ve been decided by something totally out of your control, and in
fact if you felt like the interview went well, it probably was out of your
control. You could spend a bunch of time second guessing everything like hiccup
you had, but that&rsquo;s both counterproductive and probably wrong.
</p>

<p>
How hiring typically works is an organization will have approved the budget for
a particular level of engineer to come on board. They&rsquo;ve already picked the
salary range and the number of positions they are willing to hire. So in that
sense for that position it really is a zero sum game. I suppose it&rsquo;s possible
for &ldquo;opportunity hires&rdquo; to take place, but nobody can cut blank checks so I
expect this to be virtually non-existent.
</p>

<p>
The best thing to do here is just move on, and maybe consider re-applying to
this place later, or even applying to another position at the same workplace.
Many places encourage this, though I haven&rsquo;t seen them do much to facilitate it.
</p>

<p>
My message to interviewers that encourage re-applying to different positions: If
you want people to re-apply because you want their talent, be sure to follow up
with them instead of making them do it! Don&rsquo;t forget that candidates oftentimes
have other places they&rsquo;ve already applied to and it&rsquo;s usually just as much
energy to apply again to your workplace as it is to apply to another. You&rsquo;ve
already turned them down once, so if anything you now require more energy to
apply to than any other random job. I&rsquo;ve straight up given up on places because
it placed this kind of onus on me. I wanted a new job in software engineering,
not a job in applying jobs ;)
</p>
</div>
</div>
</div>
